code/mobile_xml_signature_sha256_plugin_1/test_files/xml-0.txt

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Header><wsa:Action wsu:Id="Id-action" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://localhost:1274/mathservice/Sub</wsa:Action><wsa:MessgeID wsu:Id="Id-messageId" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">urn:uuid:cef03880-4d44-4dea-bfb4-3bc417665dcc</wsa:MessgeID><wsa:To wsu:Id="Id-to" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">http://localhost:1274/MathService/MathService.asmx</wsa:To><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsu:Timestamp wsu:Id="timestamp" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Created>2007-03-16T12:58:05Z</wsu:Created><wsu:Expires>2007-03-16T13:03:05Z</wsu:Expires></wsu:Timestamp><wsse:BinarySecurityToken ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" wsu:Id="X509Token" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">MIIBvDCCAWqgAwIBAgIQvarl6/O2YrJJWqunRWRKgTAJBgUrDgMCHQUAMBYxFDASBgNVBAMTC1Jvb3QgQWdlbmN5MB4XDTA3MDMwNzE0NTM0M1oXDTM5MTIzMTIzNTk1OVowHzEdMBsGA1UEAxMUV1NFMlF1aWNrU3RhcnRDbGllbnQwgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBALgzBXmdTeVodfyLiDU569Pmj1E4IFpkkiznzLz8cxhhX2soP5mObKn7abTda25VmWMsBtXuoZ1KErCTmtUhduSXdsNrQ46qbZzedu/RJ7DfM1N5wTXalGQhNb1DwM4hiKHw7xstPRKkllWDyLsGAgGgdqHXwrg+m04DPAznY+N9AgMBAAGjSzBJMEcGA1UdAQRAMD6AEBLkCS0GHR1PAI1hIdwWZGOhGDAWMRQwEgYDVQQDEwtSb290IEFnZW5jeYIQBjdsAKoAZIoRz7jUqlw19DAJBgUrDgMCHQUAA0EAKu+1e/OxV2hX8d1sV7t47xPw/NQF/+Qdj16zNUQWVYfkJTWNfnoYz0WJ8ePTXKDxh4sprMYK7OhPmi/IB/HxYQ==</wsse:BinarySecurityToken><Signature xmlns="http://www.w3.org/2000/09/xmldsig#" Id="Mobile_WSE_v1.0"><SignedInfo xmlns="http://www.w3.org/2000/09/xmldsig#"><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" /><Reference URI="#Id-action"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>Mm8/CdgPCJOIwnWy7x5W/O+kCZU=</DigestValue></Reference><Reference URI="#Id-messageId"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>1wfc8g8VpgQ9uqjZktZ3c9cCc8M=</DigestValue></Reference><Reference URI="#Id-to"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>d65Ut44ERmIm+clodZPwQEyEK8I=</DigestValue></Reference><Reference URI="#timestamp"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>+z6459QabTUD6gITRbQqLgOPieA=</DigestValue></Reference></SignedInfo><SignatureValue xmlns="http://www.w3.org/2000/09/xmldsig#">Kjv+Wc6JqaGh/HFzKE3yxz4VRPPc0/vBWxCxT7a8ODJmzVPVkgiEk1CoAfA7mFlVuxRtmDZX4pDdtK1bKXbDL4PUsGX/SPuv6jLOYbBCXFV/8jHhX8232U/KhkNwgth99dR+oWLjKpB8JEHA5Wg8dPPH6/AUdPethICeux3ptCQ=</SignatureValue><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:Reference URI="#X509Token" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" /></wsse:SecurityTokenReference></ds:KeyInfo></Signature></wsse:Security></soap:Header><soap:Body><Sub xmlns="http://localhost:1274/mathservice/"><a>67890</a><b>12345</b></Sub></soap:Body></soap:Envelope>